Repository: antono/valum
Catalog: docs/po/*/LC_MESSAGES/application.po
Languages: fr

source: This document explains step-by-step the sample presented in the :doc:`getting-started` document.
fr: Ce document explique étape-par-étape l'exemple de code présenté dans le document :doc:`getting-started`.

source: Many implementations are provided and documented in :doc:`vsgi/server/index`.
fr: Plusieurs implémentations sont fournies et documentées dans :doc:`vsgi/server/index`.

source: Creating an application
fr: Créer une application

source: An application is defined by a function that respects the ``VSGI.ApplicationCallback`` delegate. The :doc:`router` provides ``handle`` for that purpose along with powerful routing facilities for client requests.
fr: Une application est définie par une fonction typée par ``VSGI.ApplicationCallback``. Le :doc:`router` fourni une fonction compatible ``handle`` ainsi qu'une multitude de fonctionnalités pour traiter les requêtes HTTP.

source: Binding a route
fr: Connecter une route

source: An application constitute of a list of routes matching and handling user requests. The router provides helpers to declare routes which internally use ``Route`` instances.
fr: Une application est constituée d'une séquence de routes qui acceptent et traitent les requêtes HTTP. Le router fournit des utilitaires afin de déclarer ces routes qui sont des instances des implémentations de la classe abstraite ``Route``.

source: Every route declaration has a callback associated that does the request processing. The callback, named handler, receives four arguments:
fr: Chaque déclaration de route est accompagnée d'une fonction de retour qui procède au traitement de la requête. Cette fonction, nommée _handler_, reçoit quatre arguments:

source: a :doc:`vsgi/request` that describes a resource being requested
fr: une :doc:`vsgi/request` qui décrit une resource demandée

source: a :doc:`vsgi/response` that correspond to that resource
fr: une :doc:`vsgi/response` qui correspond à cette resource

source: a ``next`` continuation to `keep routing`
fr: une continuation ``next`` afin de continuer le routage

source: a routing ``context`` to retrieve and store states from previous and for following handlers
fr: un contexte de routage ``context`` afin de récupérer et stocker des états produits et destinés respectivement aux routes précédentes et suivantes

source: For an alternative, more structured approach to route binding, see :ref:`cleaning-up-route-logic`
fr: Pour une approche alternative et plus structurées à la déclaration de routes, consulter :ref:`cleaning-up-route-logic`.

source: Serving the application
fr: Servir l'application

source: This part is pretty straightforward: you create a server that will serve your application at port ``3003`` and since ``http`` was specified, it will be served with :doc:`vsgi/server/http`.
fr: Cette partie est relativement simple: un server est créé afin de desservir l'application au port ``3003`` et puisque ``http`` est spécifié, l'application sera servie par :doc:`vsgi/server/http`.

source: :doc:`vsgi/server/index` takes an application identifier and an ``ApplicationCallback``, which is respected by the ``handle`` function.
fr: :doc:`vsgi/server/index` prend un identifiant d'application et une fonction de retour de type ``ApplicationCallback``, qui est ``handle`` dans ce cas spécifique.

source: Minimal application can be defined using a simple lambda function taking a :doc:`vsgi/request` and :doc:`vsgi/response`.
fr: Une application minimale peut-être définie en utilisant une simple fonction de retour qui prend pour argument la paire :doc:`vsgi/request` et :doc:`vsgi/response`.

source: Usually, you would only pass the CLI arguments to ``run``, so that your runtime can be parametrized easily, but in this case we just want our application to run with fixed parameters. Options are documented per implementation.
fr: Normalement, les arguments de la ligne de commande sont fourni à ``run`` afin de pouvoir paramétriser l'exécution, mais dans ce cas on ne fait que fournir des paramètres fixés. Les options sont documentés par implémentation.
