Repository: antono/valum
Catalog: docs/po/*/LC_MESSAGES/getting-started.po
Languages: fr

source: Quickstart
fr: Débuter

source: Assuming that Valum is built and installed correctly (view :doc:`installation` for more details), you are ready to create your first application!
fr: En assumant que Valum est construit et installé correctement (voir :doc:`installation` pour les détails), vous êtres en mesure de créer votre propre application!

source: Simple 'Hello world!' application
fr: Hello world!

source: You can use this sample application and project structure as a basis. The full `valum-framework/example`_ is available on GitHub and is kept up-to-date with the latest changes in the framework.
fr: Vous pouvez utiliser cette application et la structure qui l'accompagne comme base. L'exemple complet `valum-framework/example`_ est disponible sur GitHub et devrait être à jour avec les derniers changements du framework.

source: Typically, the ``run`` function contains CLI argument to make runtime the parametrizable.
fr: Typiquement, la fonction ``run`` contient les argument de la ligne de commande.

source: It is suggested to use the following structure for your project, but you can do pretty much what you think is the best for your needs.
fr: La structure suivante est suggérée pour votre projet, mais vous pouvez faire ce qui vous semble le plus approprié pour vos besoins.

source: Building with valac
fr: Construire avec valac

source: Simple applications can be built directly with ``valac``:
fr: Les applications simples peuvent être construire directement à l'aide du compilateur Vala.

source: The ``vala`` program will build and run the produced binary, which is convenient for testing:
fr: Le programme ``vala`` construit et exécute le binaire produit, ce qui peut s'avérer très convivial pour tester:

source: Building with Meson
fr: Construire avec Meson

source: `Meson`_ is highly-recommended for its simplicity and expressiveness. It's not as flexible as waf, but it will handle most projects very well.
fr: `Meson`_ est fortement recommendé pour sa simplicité et son expressivité. Il n'est pas aussi flexible que waf, mais saura prendre en charge la plupart des projets avec aisance.

source: To include Valum as a subproject, it is sufficient to clone the repository into ``subprojects/valum``.
fr: Pour inclure Valum comme un sous-projet, il est suffisant de cloner le dépôt git sous ``subprojects/valum``.

source: Building with waf
fr: Construire avec waf

source: It is preferable to use a build system like `waf`_ to automate all this process. Get a release of ``waf`` and copy this file under the name ``wscript`` at the root of your project.
fr: Il est préférable d'utiliser un système de fabrication de logiciel comme `waf`_ afin d'automatiser tout ce processus. Il vous faudra distribuer le script ``waf`` ainsi qu'un fichier ``wscript`` à la racine de votre projet.

source: You should now be able to build by issuing the following commands:
fr: Vous devriez pouvoir construire votre application à l'aide des commandes suivantes:

source: Running the example
fr: Exécuter l'exemple

source: VSGI produces process-based applications that are either self-hosted or able to communicate with a HTTP server according to a standardized protocol.
fr: VSGI produit des applications qui sont soit prêtes à reçevoir des requêtes HTTP ou bien capable de communiquer avec un serveur HTTP à l'aide d'un protocole standardisé.

source: The :doc:`vsgi/server/http` implementation is self-hosting, so you just have to run it and point your browser at http://127.0.0.1:3003 to see the result.
fr: L'implémentation :doc:`vsgi/server/http` est prête à reçevoir des requête directement. Il suffit de l'exécuter et d'ouvrir la page http://127.0.0.1:3003/ afin d'en voir le résultat.
