Repository: antono/valum
Catalog: po/*.po
Languages: fr

source: The server encountered an unexpected condition which prevented it from fulfilling the request.
fr: Le serveur a rencontré une condition innatendue qui l'empêche de remplir la requête.

source: The '%s' encoding is not supported.
fr: L'encodage '%s' n'est pas supporté.

source: 'MatcherRoute' does not support reversing URLs.
fr: 'MatcherRoute' ne supporte pas le renversement d'URL.

source: '%s' cannot be satisfied: nothing is expected.
fr: '%s' ne peut pas être satisfait: rien n'est attendu.

source: '%s' is not satisfiable by any of '%s'.
fr: '%s' ne peut pas être satisfait par '%s'.

source: 'RegexRoute' does not support reversing URLs.
fr: 'RegexRoute' ne supporte pas le renversement d'URL.

source: No such route named '%s'.
fr: Aucune route nommée '%s'.

source: The request URI '%s' was not found.
fr: L'URI '%s' de la requête n'a pas été trouvé.

source: Using an undefined type '%s' for capture '%s'.
fr: Utilisation d'un type indéfini '%s' pour la capture '%s'.

source: The parameter '%s' was not provided.
fr: Le paramètre '%s' n'est pas fourni.

source: The 'Content-Type' header could not be infered with certainty.
fr: L'en-tête 'Content-Type' n'a pas pu être inférée avec certitude.

source: You cannot access this resource.
fr: Vous ne pouvez pas accéder cette ressource.
